{
  "imDbId": "tt0306414",
  "title": "The Wire",
  "fullTitle": "The Wire (TV Series 2002–2008)",
  "type": "TVSeries",
  "year": "2002",
  "episodes": [
    {
      "id": "tt0749451",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "The Target",
      "image": "https://imdb-api.com/images/original/MV5BMGQ3NzJhMGUtMzNjZS00MjA4LWI0YTYtZDc0N2I4MzczYjYxXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "2 Jun. 2002",
      "plot": "Baltimore Det. Jimmy McNulty finds himself in hot water with his superior Major William Rawls after a drug dealer, D'Angelo Barksdale who is charged with three murders, is acquitted. McNulty knows the judge in question and although it's not his case, he's called into chambers to explain what happened. Obviously key witnesses recanted their police statements on the stand but McNulty doesn't underplay Barksdale's role in at least 7 other murders. When the judge's raises his concerns at the senior levels of the police department, they have a new investigation on their ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "5037"
    },
    {
      "id": "tt0749448",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "The Detail",
      "image": "https://imdb-api.com/images/original/MV5BNzgwNjBmNDQtMmUzMC00ZGE0LWJkZGUtMjZhYjI0MTI2NjQxXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "9 Jun. 2002",
      "plot": "Lt. Daniels puts his team together but the extra help he's asked includes several less than stellar officers. It also includes McNulty, who is obviously in the doghouse. When one of the witnesses against D'Angelo Barksdale is found dead, McNulty and his homicide partner 'Bunk' Moreland bring him in for questioning. They have no evidence that he had anything to do with the killing but their instincts tell them otherwise. When news of the witnesses death hits the press, Major Rawls is convinced that McNulty is again responsible. Three of the newly assigned detectives, ...",
      "imDbRating": "8.3",
      "imDbRatingCount": "4098"
    },
    {
      "id": "tt0749446",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "The Buys",
      "image": "https://imdb-api.com/images/original/MV5BMzVhMzc0ZTQtM2JhNi00OGI1LTg1ZjItNjdlYTYwY2U1OWY3XkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "16 Jun. 2002",
      "plot": "After two weeks on the job, the team still doesn't have a photo of their principal target, Avon Barksdale. Freamon has a solution when he hears Avon was a Gold Gloves boxer. In the aftermath of the near riot at the towers, Lt. Daniels stands by his men even though he thinks they were stupid to do what they did. He's ordered to lead a raid on the low-rise units in the projects but McNulty rebels and refuses to participate in a raid that's just being put up for show. Dissatisfied with the antiquated equipment they have to work with, McNulty asks his friend at the FBI to...",
      "imDbRating": "8.3",
      "imDbRatingCount": "3841"
    },
    {
      "id": "tt0749437",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Old Cases",
      "image": "https://imdb-api.com/images/original/MV5BNDMzNzFjZjQtM2E0Mi00MmJlLWExZTktY2E1ZWIwNTk0MzUyXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "23 Jun. 2002",
      "plot": "Bodie walks out of detention pretending to be a janitor but Patty is recovering in hospital and is pleased that his injuries will result in a medical pension. Avon Barksdale puts a contract out on Omar and others who robbed him. He wants to make sure everyone on the street knows he's not to be messed with. Judge Phelan keeps the pressure on and Daniels recommends to the Deputy that they need a wire. McNulty suggests they get a warrant to clone the pagers the drug runners use. Det. Fremon is one step ahead of everyone having already found D'Angelo Barksdale's pager ...",
      "imDbRating": "8.3",
      "imDbRatingCount": "3710"
    },
    {
      "id": "tt0749450",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "The Pager",
      "image": "https://imdb-api.com/images/original/MV5BNTFhMjcxNjgtODQ0My00MDI1LTljNWMtNzQzOGYwMjBhNGFiXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "30 Jun. 2002",
      "plot": "Avon Barksdale is becoming paranoid and thinks he's being watched. He's also worried his phone is being tapped. He also thinks there's a snitch in D'Angelo's crew and he's told not to pay anyone until it's sorted. D'Angelo isn't too pleased when he hears Avon has given Stinkum a new territory. Judge Phelan visits the squad to sign the warrants to clone D'Angelo Barksdale's pager. The numbers they're collecting are coded and don't make much sense. Det. Prez Pryzbylewski figures it out however. McNulty and Greggs try to get information from Omar.",
      "imDbRating": "8.4",
      "imDbRatingCount": "3556"
    },
    {
      "id": "tt0749452",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "The Wire",
      "image": "https://imdb-api.com/images/original/MV5BOGMwMDY1MDMtOGQ4MC00Mzc3LTlhN2EtNTQ3NDVmMDUwMTYxXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "7 Jul. 2002",
      "plot": "Avon takes care of Omar's man Brandon but Wallace, who saw Brandon in the arcade, isn't too comfortable when he sees what they've done to him. Avon gives D'Angelo and Wallace a bonus for their good work. The police meanwhile get authorization to place taps for the pay phones used by D'Angelo and his crew but can only listen in when one of their suspects is using it meaning they'll have to keep the phones under constant observation. McNulty is in a tight spot when Major Rawls gives him a week to report back to his old job. When he realizes the connections McNulty's ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "3735"
    },
    {
      "id": "tt0749438",
      "seasonNumber": "1",
      "episodeNumber": "7",
      "title": "One Arrest",
      "image": "https://imdb-api.com/images/original/MV5BMDg5ZWI4MGQtNDRmMi00ZGFlLWEzMjgtZjQ5ZTQ3ZWNhNzliXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "21 Jul. 2002",
      "plot": "Burrell reluctantly sides with Daniels in the disagreement with Rawls, giving the detail more time to make a case against Avon, despite his fears the operation is beginning to sprawl. McNulty and Pearlman present the detail's findings to Phelan, who signs an affidavit for a further thirty days of electronic surveillance. Using information from the wire on the pit pay-phones, the detail catch a runner on his way to the pit with a re-up. However, they elect not to arrest the driver, Anton 'Stinkum' Artis (Brandon Price), so as to avoid giving up their evidence in the charging ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "3485"
    },
    {
      "id": "tt0749433",
      "seasonNumber": "1",
      "episodeNumber": "8",
      "title": "Lessons",
      "image": "https://imdb-api.com/images/original/MV5BZWM5YjhjZjMtNGJjZC00NmEyLWJjMzItOTZmMjA4ODRiNGIwXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "28 Jul. 2002",
      "plot": "McNulty uses his children to tail Stringer after a chance encounter in a local market, with one of them getting his license plate. As the detail discuss the implications of the pit pay-phones being disconnected, speculating the crew are going to start using phones outside their immediate area of operations, Herc and Carver prepare for the sergeant's exam. Stinkum, Roland 'Wee-Bey' Brice (Hassan Johnson), and Savino Bratton (Chris Clanton) raid Omar's pad, but he is nowhere to be found. Avon is unhappy when he learns of Orlando's proposal to D'Angelo. Meanwhile, Greggs and Carver arrest a driver...",
      "imDbRating": "8.6",
      "imDbRatingCount": "3452"
    },
    {
      "id": "tt0749429",
      "seasonNumber": "1",
      "episodeNumber": "9",
      "title": "Game Day",
      "image": "https://imdb-api.com/images/original/MV5BOTQyY2YwYmYtZDRlOC00MDU2LWEzZjYtYjUwZGM5ZTRjZmIxXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "4 Aug. 2002",
      "plot": "D'Angelo speaks to Wallace, who tells him he wants to go back to school and get out of the Game. However, Malik 'Poot' Carr (Tray Chaney) discovers Wallace has started using cocaine to help him deal with his guilt over Brandon's murder. Freamon gets Sydnor and Prez started on the complex Barksdale money trail, including possible political connections, and they are surprised to find Avon's corporations have been buying up vacant buildings in run-down parts of the city. Greggs and Freamon approach D'Angelo's girlfriend, Shardene Ennis (Wendy Grantham), who works at Orlando's, in the hopes they ...",
      "imDbRating": "8.8",
      "imDbRatingCount": "3572"
    },
    {
      "id": "tt0749447",
      "seasonNumber": "1",
      "episodeNumber": "10",
      "title": "The Cost",
      "image": "https://imdb-api.com/images/original/MV5BMGE1Njg0MTEtOTUzMC00ZTEyLThlZDUtZDAyMzU1ZGU3ZTM3XkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "11 Aug. 2002",
      "plot": "Avon, Stringer and Wee-Bey discuss how best to deal with Omar after the attempted hit on Avon, deciding to let him think they want peace, whilst secretly planning to kill him. As such, Omar and Stringer meet for a parley, with security provided by Prop Joe. Meanwhile, Stringer insists on decreasing Avon's visibility in light of the detail's attempt to follow him after the basketball game. An irritable Phelan signs an affidavit for the new phone being used by the pit crew, and Pearlman tells McNulty that he is not up for automatic re-election, possibly because of the ...",
      "imDbRating": "9.2",
      "imDbRatingCount": "4044"
    },
    {
      "id": "tt0749449",
      "seasonNumber": "1",
      "episodeNumber": "11",
      "title": "The Hunt",
      "image": "https://imdb-api.com/images/original/MV5BYjkxYTI2MzUtOGE0MC00YTExLTg1NDYtYTI4NGEyYTNjNGM1XkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "18 Aug. 2002",
      "plot": "While Greggs' life hangs in the balance, the entire department attempts to hunt down Savino. When Wallace flips, willing to testify that Stringer, Wee-Bey and Bird killed Brandon, Daniels stashes him in his grandmother's house on the outskirts of the city, but he soon becomes restless. Stringer tells Wee-Bey he needs to get out of Baltimore until the Savino investigation cools off, whilst Avon considers his next move. When McNulty and Pearlman try to pressure Levy into giving up Savino, he proves smarter than they gave him credit for. Meanwhile, when the detail's hand...",
      "imDbRating": "8.9",
      "imDbRatingCount": "3565"
    },
    {
      "id": "tt0749424",
      "seasonNumber": "1",
      "episodeNumber": "12",
      "title": "Cleaning Up",
      "image": "https://imdb-api.com/images/original/MV5BMjdkY2RlYzMtYmRjYi00ZThmLWJhMTgtYWE1NmVlNDkxM2EzXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "1 Sep. 2002",
      "plot": "Kima slowly recovers in the hospital. Stringer changes operations in the pit and the towers, rendering the wiretaps and clones useless, and prompting Burrell to begin dismantling the detail. Avon and Stringer meet Levy to discuss where their organization is vulnerable. Unbeknownst to the detail, Wallace returns to the pit to resume work. When Prez starts pulling political campaign finance reports, Pearlman is called to a meeting with a worried State's Attorney, and an angry Clay Davis confronts Daniels. Meanwhile, Stinger issues a difficult order to Bodie and Poot. ...",
      "imDbRating": "9.1",
      "imDbRatingCount": "3827"
    },
    {
      "id": "tt0749441",
      "seasonNumber": "1",
      "episodeNumber": "13",
      "title": "Sentencing",
      "image": "https://imdb-api.com/images/original/MV5BMDAzYmU2ZDctMjNjZC00MTAzLWIzY2MtODA0ZWY3ZGNkN2Q4XkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "8 Sep. 2002",
      "plot": "Due to the camera at Orlando's, the detail gather enough information to arrest Avon and many of his people, but, with Wallace dead, they are unable to bring charges against Stringer, who's left on the street. However, disgusted that Avon and Stringer had Wallace killed, D'Angelo flips on the entire organization, giving the detail more information than they could have ever hoped for. As Daniels figures out who the snitch is in the unit, Herc is shocked when he is passed over for promotion in favor of Carver, who scored lower on the sergeant's exam. In Philadelphia, ...",
      "imDbRating": "9.0",
      "imDbRatingCount": "3743"
    }
  ],
  "errorMessage": ""
}
